---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.GridColor
source: html/b64ac4b3-5d1a-818e-37f7-de6440819787.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings.GridColor Property

Color of grid lines.

## Syntax (C#)
```csharp
public Color GridColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null